{
    "analyzer": "The name of the analyzer to use for the field. This option can be used only with searchable fields and it can't be set together with either searchAnalyzer or indexAnalyzer. Once the analyzer is chosen, it cannot be changed for the field. Must be null for complex fields.",
    "dimensions": "The dimensionality of the vector field. (min: 2, max: 4096)",
    "facetable": "A value indicating whether to enable the field to be referenced in facet queries. Typically used in a presentation of search results that includes hit count by category. This property must be null for complex fields. Fields of type Edm.GeographyPoint or Collection(Edm.GeographyPoint) cannot be facetable. Default is true for all other simple fields.",
    "fields": "A list of sub-fields if this is a field of type Edm.ComplexType or Collection(Edm.ComplexType). Must be null or empty for simple fields.",
    "filterable": "A value indicating whether to enable the field to be referenced in $filter queries. Filterable differs from searchable in how strings are handled. Fields of type Edm.String or Collection(Edm.String) that are filterable do not undergo word-breaking, so comparisons are for exact matches only. This property must be null for complex fields. Default is true for simple fields.",
    "indexAnalyzer": "The name of the analyzer used at indexing time for the field. This option can be used only with searchable fields. It must be set together with searchAnalyzer and it cannot be set together with the analyzer option. Must be null for complex fields.",
    "key": "A value indicating whether the field uniquely identifies documents in the index. Exactly one top-level field in each index must be chosen as the key field and it must be of type Edm.String. Key fields can be used to look up documents directly. Default is false for simple fields and null for complex fields.",
    "name": "The name of the field, which must be unique within the fields collection of the index or parent field.",
    "normalizer": "The name of the normalizer to use for the field. This option can be used only with fields with filterable, sortable, or facetable enabled. Once the normalizer is chosen, it cannot be changed for the field. Must be null for complex fields.",
    "retrievable": "A value indicating whether the field can be returned in a search result. You can disable this option if you want to use a field as a filter, sorting, or scoring mechanism but do not want the field to be visible to the end user. This property must be true for key fields. Default is true for simple fields, false for vector fields.",
    "searchAnalyzer": "The name of the analyzer used at search time for the field. This option can be used only with searchable fields. It must be set together with indexAnalyzer and it cannot be set together with the analyzer option. This analyzer can be updated on an existing field. Must be null for complex fields.",
    "searchable": "A value indicating whether the field is full-text searchable. This means it will undergo analysis such as word-breaking during indexing. Fields of type Edm.String or Collection(Edm.String) are searchable by default. This property must be false for simple fields of other non-string data types, and it must be null for complex fields.",
    "sortable": "A value indicating whether to enable the field to be referenced in $orderby expressions. A simple field can be sortable only if it is single-valued. Simple collection fields cannot be sortable. Complex fields cannot be sortable. The default is true for single-valued simple fields, false for multi-valued simple fields.",
    "stored": "An immutable value indicating whether the field will be persisted separately on disk to be returned in a search result. Disabling this option reduces index storage. This can only be set during index creation and only for vector fields. If false, retrievable must also be false. Default is true for vector fields.",
    "synonymMaps": "A list of the names of synonym maps to associate with this field. This option can be used only with searchable fields. Currently only one synonym map per field is supported.",
    "type": "The data type of the field.",
    "vectorEncoding": "The encoding format to interpret the field contents.",
    "vectorSearchProfile": "The name of the vector search profile that specifies the algorithm and vectorizer to use when searching the vector field."
}