{
  "discriminatorValue": "#Microsoft.Skills.Text.PIIDetectionSkill",
  "label": "PIIDetectionSkill",
  "description": "Using the Text Analytics API, extracts personal information from an input text and gives you the option of masking it.",
  "fields": [
    {
      "key": "context",
      "label": "Context",
      "type": "string",
      "tooltip": "Represents the level at which operations take place, such as the document root or document content (for example, /document or /document/content). The default is /document."
    },
    {
      "key": "defaultLanguageCode",
      "label": "Default Language Code",
      "type": "string",
      "tooltip": "A value indicating which language code to use. Default is en."
    },
    {
      "key": "description",
      "label": "Description",
      "type": "string",
      "tooltip": "The description of the skill which describes the inputs, outputs, and usage of the skill."
    },
    {
      "key": "domain",
      "label": "Domain",
      "type": "string",
      "tooltip": "If specified, will set the PII domain to include only a subset of the entity categories. Possible values include: 'phi', 'none'. Default is 'none'."
    },
    {
      "key": "inputs",
      "label": "Inputs",
      "type": "objectArray",
      "tooltip": "Inputs of the skills could be a column in the source data set, or the output of an upstream skill.",
      "schema": { "$ref": "Skillset/types/InputFieldMappingEntry.json" }
    },
    {
      "key": "maskingCharacter",
      "label": "Masking Character",
      "type": "string",
      "tooltip": "The character used to mask the text if the maskingMode parameter is set to replace. Default is '*'."
    },
    {
      "key": "maskingMode",
      "label": "Masking Mode",
      "type": "enum",
      "tooltip": "A parameter that provides various ways to mask the personal information detected in the input text. Default is 'none'.",
      "options": { "$ref": "Skillset/Skills/enums/PIIDetectionSkillMaskingMode.json" }
    },
    {
      "key": "minimumPrecision",
      "label": "Minimum Precision",
      "type": "number",
      "tooltip": "A value between 0 and 1 that be used to only include entities whose confidence score is greater than the value specified. If not set (default), or if explicitly set to null, all entities will be included."
    },
    {
      "key": "modelVersion",
      "label": "Model Version",
      "type": "string",
      "tooltip": "The version of the model to use when calling the Text Analytics service. It will default to the latest available when not specified. We recommend you do not specify this value unless absolutely necessary."
    },
    {
      "key": "name",
      "label": "Name",
      "type": "string",
      "tooltip": "The name of the skill which uniquely identifies it within the skillset. A skill with no name defined will be given a default name of its 1-based index in the skills array, prefixed with the character '#'."
    },
    {
      "key": "outputs",
      "label": "Outputs",
      "type": "objectArray",
      "tooltip": "The output of a skill is either a field in a search index, or a value that can be consumed as an input by another skill.",
      "schema": { "$ref": "Skillset/types/OutputFieldMappingEntry.json" }
    },
    {
      "key": "piiCategories",
      "label": "PII Categories",
      "type": "stringArray",
      "tooltip": "A list of PII entity categories that should be extracted and masked."
    }
  ]
}
