[
  { "value": "arabic", "description": "Selects the Lucene stemming tokenizer for Arabic." },
  { "value": "armenian", "description": "Selects the Lucene stemming tokenizer for Armenian." },
  { "value": "basque", "description": "Selects the Lucene stemming tokenizer for Basque." },
  { "value": "brazilian", "description": "Selects the Lucene stemming tokenizer for Portuguese (Brazil)." },
  { "value": "bulgarian", "description": "Selects the Lucene stemming tokenizer for Bulgarian." },
  { "value": "catalan", "description": "Selects the Lucene stemming tokenizer for Catalan." },
  { "value": "czech", "description": "Selects the Lucene stemming tokenizer for Czech." },
  { "value": "danish", "description": "Selects the Lucene stemming tokenizer for Danish." },
  { "value": "dutch", "description": "Selects the Lucene stemming tokenizer for Dutch." },
  { "value": "dutchKp", "description": "Selects the Lucene stemming tokenizer for Dutch that uses the Kraaij-Pohlmann stemming algorithm." },
  { "value": "english", "description": "Selects the Lucene stemming tokenizer for English." },
  { "value": "lightEnglish", "description": "Selects the Lucene stemming tokenizer for English that does light stemming." },
  { "value": "minimalEnglish", "description": "Selects the Lucene stemming tokenizer for English that does minimal stemming." },
  { "value": "possessiveEnglish", "description": "Selects the Lucene stemming tokenizer for English that removes trailing possessives from words." },
  { "value": "porter2", "description": "Selects the Lucene stemming tokenizer for English that uses the Porter2 stemming algorithm." },
  { "value": "lovins", "description": "Selects the Lucene stemming tokenizer for English that uses the Lovins stemming algorithm." },
  { "value": "finnish", "description": "Selects the Lucene stemming tokenizer for Finnish." },
  { "value": "lightFinnish", "description": "Selects the Lucene stemming tokenizer for Finnish that does light stemming." },
  { "value": "french", "description": "Selects the Lucene stemming tokenizer for French." },
  { "value": "lightFrench", "description": "Selects the Lucene stemming tokenizer for French that does light stemming." },
  { "value": "minimalFrench", "description": "Selects the Lucene stemming tokenizer for French that does minimal stemming." },
  { "value": "galician", "description": "Selects the Lucene stemming tokenizer for Galician." },
  { "value": "minimalGalician", "description": "Selects the Lucene stemming tokenizer for Galician that does minimal stemming." },
  { "value": "german", "description": "Selects the Lucene stemming tokenizer for German." },
  { "value": "german2", "description": "Selects the Lucene stemming tokenizer that uses the German variant algorithm." },
  { "value": "lightGerman", "description": "Selects the Lucene stemming tokenizer for German that does light stemming." },
  { "value": "minimalGerman", "description": "Selects the Lucene stemming tokenizer for German that does minimal stemming." },
  { "value": "greek", "description": "Selects the Lucene stemming tokenizer for Greek." },
  { "value": "hindi", "description": "Selects the Lucene stemming tokenizer for Hindi." },
  { "value": "hungarian", "description": "Selects the Lucene stemming tokenizer for Hungarian." },
  { "value": "lightHungarian", "description": "Selects the Lucene stemming tokenizer for Hungarian that does light stemming." },
  { "value": "indonesian", "description": "Selects the Lucene stemming tokenizer for Indonesian." },
  { "value": "irish", "description": "Selects the Lucene stemming tokenizer for Irish." },
  { "value": "italian", "description": "Selects the Lucene stemming tokenizer for Italian." },
  { "value": "lightItalian", "description": "Selects the Lucene stemming tokenizer for Italian that does light stemming." },
  { "value": "sorani", "description": "Selects the Lucene stemming tokenizer for Sorani." },
  { "value": "latvian", "description": "Selects the Lucene stemming tokenizer for Latvian." },
  { "value": "norwegian", "description": "Selects the Lucene stemming tokenizer for Norwegian (Bokmål)." },
  { "value": "lightNorwegian", "description": "Selects the Lucene stemming tokenizer for Norwegian (Bokmål) that does light stemming." },
  { "value": "minimalNorwegian", "description": "Selects the Lucene stemming tokenizer for Norwegian (Bokmål) that does minimal stemming." },
  { "value": "lightNynorsk", "description": "Selects the Lucene stemming tokenizer for Norwegian (Nynorsk) that does light stemming." },
  { "value": "minimalNynorsk", "description": "Selects the Lucene stemming tokenizer for Norwegian (Nynorsk) that does minimal stemming." },
  { "value": "portuguese", "description": "Selects the Lucene stemming tokenizer for Portuguese." },
  { "value": "lightPortuguese", "description": "Selects the Lucene stemming tokenizer for Portuguese that does light stemming." },
  { "value": "minimalPortuguese", "description": "Selects the Lucene stemming tokenizer for Portuguese that does minimal stemming." },
  { "value": "portugueseRslp", "description": "Selects the Lucene stemming tokenizer for Portuguese that uses the RSLP stemming algorithm." },
  { "value": "romanian", "description": "Selects the Lucene stemming tokenizer for Romanian." },
  { "value": "russian", "description": "Selects the Lucene stemming tokenizer for Russian." },
  { "value": "lightRussian", "description": "Selects the Lucene stemming tokenizer for Russian that does light stemming." },
  { "value": "spanish", "description": "Selects the Lucene stemming tokenizer for Spanish." },
  { "value": "lightSpanish", "description": "Selects the Lucene stemming tokenizer for Spanish that does light stemming." },
  { "value": "swedish", "description": "Selects the Lucene stemming tokenizer for Swedish." },
  { "value": "lightSwedish", "description": "Selects the Lucene stemming tokenizer for Swedish that does light stemming." },
  { "value": "turkish", "description": "Selects the Lucene stemming tokenizer for Turkish." }
]
